In [24]:
import pandas as pd
import numpy as np

train_data=pd.read_csv("C:\SOAR\ALL MODELS\DATASETS\Titanic\Train.csv")

In [25]:
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [26]:
train_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
corr_matrix=train_data.corr()
corr_matrix

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [28]:
train_data[['SibSp','Survived']].groupby(['SibSp']).mean().sort_values(by='Survived',ascending=False)

       Survived
SibSp
1      0.535885
2      0.464286
0      0.345395
3      0.250000
4      0.166667
5      0.000000
8      0.000000

In [29]:
train_data['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

In [30]:
train_data['SibSp']=np.where(train_data['SibSp']>0,1,0)

In [31]:
train_data['SibSp'].value_counts()

0    608
1    283
Name: SibSp, dtype: int64

In [32]:
train_data[['SibSp','Survived']].groupby(['SibSp']).mean().sort_values(by='Survived',ascending=False)

       Survived
SibSp
1      0.466431
0      0.345395

In [33]:
train_data['Parch']=np.where(train_data['Parch']>0,1,0)

In [34]:
train_data[['Parch','Survived']].groupby(['Parch']).mean().sort_values(by='Survived',ascending=False)

       Survived
Parch
1      0.511737
0      0.343658

In [35]:
train_data['Sex']=np.where(train_data['Sex']=="male",1,0)

In [36]:
train_data[['Sex','Survived']].groupby(['Sex']).mean().sort_values(by='Survived',ascending=False)

     Survived
Sex
0    0.742038
1    0.188908

In [38]:
train_data['Cabin'].value_counts()
list=train_data['Cabin']